{"referenceId": "5636075", "lessonid": "1", "text": "It was wonderful to see [name] in my classroom today! [name] did a wonderful job continuing to learn about America. The objective of the lesson today was to learn about America and American culture. The vocabulary words from the lesson today were: American, computer, screen, mouse, desks, and classroom. The sentence patterns used in the lesson today included: Where do you live? I live in America. What is this? This is _. What are these? These are _. What can you see? I can see _. Your child had five sight words today: it, you, in, said, for. In phonics, your child read words using the letter blends ‘-at’ and ‘-an.’ In grammar, we used the action words: read, write, click, and draw. In math Your child counted from 11-20 and did a great job today!"}
{"referenceId": "9410222", "lessonid": "2", "text": "It was great to see [name] today!  [name] did an awesome job on their assessment!  The assessment included: Matching letters big and small (Mm, Nn, Oo, Pp, Rr, Vv, Tt, Xx, Ww, Zz, and vowels), reading and circling sight words (and, to, the, a, I), recognizing and counting numbers 5-10, identifying and matching teacher/school and mad/happy/sad, discussing school and teachers, and capitalizing the beginning of names.  [name] showed me their final project and I can tell they put a lot of effort into it!  I hope to see your child again soon!"}
{"referenceId": "4978196", "lessonid": "3", "text": "I was happy to see your child in class today! Today was the first lesson in our unit, Animals I Know. [name] practiced the vocabulary words: 'farm', 'house', 'cat', 'dog', 'pig', and 'chicken'. We also practiced using the sentence structures 'What animal is it?', 'This is a _____.', 'Is this a _____?', 'Yes, it is a _____', and 'No, it isn't, it is a _____.' [name] also practiced the vowels a, e, i, o, and u. We then used them in the blends '-all', '-ell', and '-ill'. We practiced the sight words 'they', 'at', 'she', 'but', and 'on'. Then, we read a story about a fat cat who got hit by a ball. To finish the lesson we practiced acting like an animal and guessing which animal it was. It was great to teach your child in class today."}

 


